stm32duino/Arduino_Core_STM32/boards.txt
# MALYANM200_F103CB board
3dprinter.menu.pnum.MALYANM200_F103CB=Malyan M200 V1
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_data_size=20480
3dprinter.menu.pnum.MALYANM200_F103CB.build.mcu=cortex-m3
3dprinter.menu.pnum.MALYANM200_F103CB.build.board=MALYANM200_F103CB
3dprinter.menu.pnum.MALYANM200_F103CB.build.series=STM32F1xx
3dprinter.menu.pnum.MALYANM200_F103CB.build.product_line=STM32F103xB
3dprinter.menu.pnum.MALYANM200_F103CB.build.variant=MALYANM200_F103CB
3dprinter.menu.pnum.MALYANM200_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
3dprinter.menu.pnum.MALYANM200_F103CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F103CB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET=0x2000

# MALYANM200_F070CB board
3dprinter.menu.pnum.MALYANM200_F070CB=Malyan M200 V2
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_data_size=15168
3dprinter.menu.pnum.MALYANM200_F070CB.build.mcu=cortex-m0
3dprinter.menu.pnum.MALYANM200_F070CB.build.board=MALYANM200_F070CB
3dprinter.menu.pnum.MALYANM200_F070CB.build.series=STM32F0xx
3dprinter.menu.pnum.MALYANM200_F070CB.build.product_line=STM32F070xB
3dprinter.menu.pnum.MALYANM200_F070CB.build.variant=MALYANM200_F070CB
3dprinter.menu.pnum.MALYANM200_F070CB.build.cmsis_lib_gcc=arm_cortexM0l_math
3dprinter.menu.pnum.MALYANM200_F070CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F070CB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET=0x2000

# VAkE v1.0
3dprinter.menu.pnum.VAKE_F446VE=VAkE v1.0
3dprinter.menu.pnum.VAKE_F446VE.upload.maximum_size=524288
3dprinter.menu.pnum.VAKE_F446VE.upload.maximum_data_size=131072
3dprinter.menu.pnum.VAKE_F446VE.build.mcu=cortex-m4
3dprinter.menu.pnum.VAKE_F446VE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.VAKE_F446VE.build.board=VAKE403
3dprinter.menu.pnum.VAKE_F446VE.build.series=STM32F4xx
3dprinter.menu.pnum.VAKE_F446VE.build.product_line=STM32F446xx
3dprinter.menu.pnum.VAKE_F446VE.build.variant=VAKE_F446VE
3dprinter.menu.pnum.VAKE_F446VE.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
3dprinter.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
3dprinter.menu.upload_method.swdMethod.upload.protocol=0
3dprinter.menu.upload_method.swdMethod.upload.options=-g
3dprinter.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
3dprinter.menu.upload_method.serialMethod.upload.protocol=1
3dprinter.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
3dprinter.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
3dprinter.menu.upload_method.dfuMethod.upload.protocol=2
3dprinter.menu.upload_method.dfuMethod.upload.options=-g
3dprinter.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg


###############################
# Genericflight Flight Controllers

Genericflight.name=Generic flight controllers

Genericflight.build.vid=0x0483
Genericflight.build.core=arduino
Genericflight.build.board=Genericflight
Genericflight.build.mcu=cortex-m3
Genericflight.build.series=STM32F1xx
Genericflight.build.cmsis_lib_gcc=arm_cortexM3l_math
Genericflight.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# AfroFlight Rev5 
Genericflight.menu.pnum.AFROFLIGHT_F103CB=Afro Flight Rev5 (8MHz)
Genericflight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_size=131072
Genericflight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_data_size=20480
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.board=AFROFLIGHT_F103CB
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.product_line=STM32F103xB
Genericflight.menu.pnum.AFROFLIGHT_F103CB.build.variant=AFROFLIGHT_F103CB

Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M=Afro Flight Rev5 (12MHz)
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_size=131072
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_data_size=20480
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.board=AFROFLIGHT_F103CB_12M
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.product_line=STM32F103xB
Genericflight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant=AFROFLIGHT_F103CB

# Sparky_V1 board
Genericflight.menu.pnum.Sparky_V1=Sparky V1 F303 FC
Genericflight.menu.pnum.Sparky_V1.upload.maximum_size=262144
Genericflight.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
Genericflight.menu.pnum.Sparky_V1.build.mcu=cortex-m4
Genericflight.menu.pnum.Sparky_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Genericflight.menu.pnum.Sparky_V1.build.board=Sparky_V1
Genericflight.menu.pnum.Sparky_V1.build.series=STM32F3xx
Genericflight.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
Genericflight.menu.pnum.Sparky_V1.build.variant=SPARKY_F303CC
Genericflight.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Genericflight.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Genericflight.menu.upload_method.swdMethod.upload.protocol=0
Genericflight.menu.upload_method.swdMethod.upload.options=-g
Genericflight.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Genericflight.menu.upload_method.serialMethod.upload.protocol=1
Genericflight.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Genericflight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Genericflight.menu.upload_method.dfuMethod.upload.protocol=2
Genericflight.menu.upload_method.dfuMethod.upload.options=-g
Genericflight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Genericflight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Genericflight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Genericflight.menu.upload_method.hidMethod=HID Bootloader 2.2
Genericflight.menu.upload_method.hidMethod.upload.protocol=hid22
Genericflight.menu.upload_method.hidMethod.upload.tool=hid_upload
Genericflight.menu.upload_method.hidMethod.build.flash_offset=0x800
Genericflight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
Genericflight.menu.upload_method.dfu2Method.upload.protocol=maple
Genericflight.menu.upload_method.dfu2Method.upload.tool=maple_upload
Genericflight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfu2Method.upload.altID=2
Genericflight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
Genericflight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
Genericflight.menu.upload_method.dfuoMethod.upload.protocol=maple
Genericflight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
Genericflight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfuoMethod.upload.altID=1
Genericflight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
Genericflight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Midatronics boards

